---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.PathReinforcement
source: html/d67829f7-3c7d-f0fe-489e-e7eff0e09240.htm
---
# PathReinforcement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.